#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`failure`

<details><summary>Show Plan</summary>

```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

The remote workspace is configured to work with configuration at
/infra/instances/staging relative to the target repository.

Terraform will upload the contents of the following directory,
excluding files or directories as defined by a .terraformignore file
at /home/runner/work/actions-hero/actions-hero/.terraformignore (if it is present),
in order to capture the filesystem context the remote workspace expects:
    /home/runner/work/actions-hero/actions-hero

To view this run in a browser, visit:
https://app.terraform.io/app/metaroon/staging/runs/run-i8hzjxjwPT5zDBTV

Waiting for the plan to start...

Terraform v1.6.3
on linux_amd64
Initializing plugins and modules...
random_string.random: Refreshing state... [id=xf5cy3e1]
google_compute_project_metadata.ssh_keys: Refreshing state... [id=academic-matter-404418]
google_compute_firewall.allow_https: Refreshing state... [id=projects/academic-matter-404418/global/firewalls/allow-https]
google_compute_firewall.allow_http: Refreshing state... [id=projects/academic-matter-404418/global/firewalls/allow-http]
google_compute_instance.staging_pr_demo: Refreshing state... [id=projects/academic-matter-404418/zones/us-central1-a/instances/staging-pr-xf5cy3e1]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # google_dns_managed_zone.my_zone will be created
  + resource "google_dns_managed_zone" "my_zone" {
      + description   = "Managed DNS zone for my domain"
      + dns_name      = "wisdomdemo.com."
      + force_destroy = false
      + id            = (known after apply)
      + name          = "pr-staging-zone"
      + name_servers  = (known after apply)
      + project       = (known after apply)
      + visibility    = "public"
    }

  # google_dns_record_set.my_instance_dns will be created
  + resource "google_dns_record_set" "my_instance_dns" {
      + id           = (known after apply)
      + managed_zone = "pr-staging-zone"
      + name         = "staging-pr-xf5cy3e1.wisdomdemo.com."
      + project      = (known after apply)
      + rrdatas      = [
          + "34.134.213.135",
        ]
      + ttl          = 300
      + type         = "A"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  - dns_details        = {
      - domain_name = "staging-pr-xf5cy3e1.wisdomdemo.com"
      - public_ip   = "34.134.213.135"
    } -> null
  + instance_public_ip = "34.134.213.135"
╷
│ Error: Reference to undeclared input variable
│ 
│   on provider.tf line 13, in provider "cloudflare":
│   13:     api_token = var.cloudflare_api_token
│ 
│ An input variable with the name "cloudflare_api_token" has not been
│ declared. This variable can be declared with a variable
│ "cloudflare_api_token" {} block.
╵
Operation failed: failed running terraform plan (exit 1)

```

</details>

*Pusher: @stoXmod, Action: `workflow_dispatch`*